---
type: BoundingBoxIntersectsFilter
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# BoundingBoxIntersectsFilter

`Autodesk.Revit.DB.BoundingBoxIntersectsFilter` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | BoundingBoxIntersectsFilter | — | `` |
| Method | GetBoundingBox | 2011 | `public Outline GetBoundingBox ()` |
| Method | PassesFilter | — | `` |
| Property | Tolerance | 2011 | `public double Tolerance { get ; set ; }` |